Revit 2026 API
ParameterFilterUtilities Methods
The ParameterFilterUtilities type exposes the following members.
Methods
Name | Description
GetAllFilterableCategories |  Returns the set of categories that may be used in a ParameterFilterElement.
GetFilterableParametersInCommon
GetInapplicableParameters
IsParameterApplicable |  Used to determine whether the element supports the given parameter.
RemoveUnfilterableCategories
Top
See Also
Reference
ParameterFilterUtilities Class
Autodesk.Revit.DB Namespace